#include "String.h"


int main()
{
	// Оголошення та ініціалізація за допомогою конструктора який приймає один аргумент - рядок 
	String str1("Hello");
	//

	// Оголошення за допомогою конструктора який приймає один аргумент - розмір 
	String str2(50);
	//

	// Ініціалізація створенної змінної за допомогою перевантаженного оператору присвоєння
	str2 = "World";
	//

	// Конкатенація рядків за допомогою перевантаженного оператору додавання
	String result = str1 + str2;
	//

	// Вивід рядка у консоль за допомогою перевантаженного оператору виведення
	cout << result << endl;
	//

	// Введення рядка у консолі та його запис у змінну рядка об'єкта за допомогою перевантаженного оператору введення
	String tmp;
	cin >> tmp;
	cout << (tmp = tmp + str1 + str2);
	cout << endl;
	//

	// Вивід кількості створених об'єктів классу реалізованний статичною змінною классу, та статичною функцією-членом
	cout << String::GetCountOfCreatedStrings() << endl;
	//

	String str3;
	String str4;
	str3.SetStr(); //введення рядку з клавіатури використовуючи оператор "cin"
	str4.SetStr("AROUND");//введення рядку з клавіатури вносячи його як параметр методу
	str3.GetStr();// *
	str4.GetStr();// * Виведення цих рядків у консоль

	return 0;
}