#include "String.h"


int main()
{
	// Оголошення та ініціалізація за допомогою конструктора який приймає один аргумент - рядок 
	String str1("Hello");
	//

	// Ініціалізація створенної змінної за допомогою перевантаженного оператору присвоєння
	String str2;
	str2 = "World";
	//

	// Конкатенація рядків за допомогою перевантаженного оператору додавання
	String result = str1 + str2;
	//

	// Вивід рядка у консоль за допомогою перевантаженного оператору виведення
	cout << result << endl;
	//

	// Введення рядка у консолі та його запис у змінну рядка об'єкта за допомогою перевантаженного оператору введення
	String tmp = "hcshdjc";
	//cin >> tmp;
	cout << (tmp = tmp + str1 + str2);
	cout << endl;
	//

	


	return 0;
}